## :x: Apply Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21168395433)



<pre><code>Error: Your token has not been granted the required scopes to execute this query. The &#39;email&#39; field requires one of the following scopes: [&#39;user:email&#39;, &#39;read:user&#39;], but your token has only been granted the: [&#39;admin:org&#39;, &#39;repo&#39;] scopes. Please modify your token&#39;s scopes at: https://github.tools.sap/settings/tokens.

  with data.github_organization.kyma_internal,
  on doc-collector.tf line 42, in data &#34;github_organization&#34; &#34;kyma_internal&#34;:
  42: data &#34;github_organization&#34; &#34;kyma_internal&#34; {

::error::OpenTofu exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.github_organization.kyma_project: Reading...
github_actions_organization_variable.image_builder_ado_pat_gcp_secret_name: Refreshing state... [id=IMAGE_BUILDER_ADO_PAT_GCP_SECRET_NAME]
github_actions_variable.github_terraform_planner_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_PLANNER_SECRET_NAME]
github_actions_organization_variable.gcp_kyma_project_project_id: Refreshing state... [id=GCP_KYMA_PROJECT_PROJECT_ID]
github_actions_variable.github_terraform_executor_secret_name: Refreshing state... [id=test-infra:GH_TERRAFORM_EXECUTOR_SECRET_NAME]
data.github_repository.test_infra: Reading...
data.github_repository.gitleaks_repository["test-infra"]: Reading...
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Refreshing state... [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
google_project_iam_member.kyma_developer_admin_private_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.privateLogViewer/group:kyma_developer_admin@sap.com]
google_service_account.kyma_project_image_builder_restricted_markets: Refreshing state... [id=projects/kyma-project/serviceAccounts/img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com]
module.prod_docker_repository.data.google_client_config.this: Reading...
module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod]
google_project_iam_member.kyma_developer_admin_editor: Refreshing state... [id=kyma-project/roles/editor/group:kyma_developer_admin@sap.com]
module.prod_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_prod.data.google_client_config.this: Reading...
module.kyma_restricted_images_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev]
data.google_project.kyma_project: Reading...
module.kyma_modules.data.google_client_config.this: Reading...
module.kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev]
module.dockerhub_mirror.data.google_client_config.this: Reading...
module.dockerhub_mirror.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.docker_cache.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache]
module.dev_kyma_modules.data.google_client_config.this: Reading...
module.dev_kyma_modules.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.kyma_restricted_images_dev.data.google_client_config.this: Reading...
module.kyma_modules.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules]
module.kyma_restricted_images_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.chainguard_cache.data.google_client_config.this: Reading...
module.chainguard_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_service_account.kyma_project_image_builder: Refreshing state... [id=projects/kyma-project/serviceAccounts/azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.dev_docker_repository.data.google_client_config.this: Reading...
module.dev_docker_repository.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules]
module.docker_cache.data.google_client_config.this: Reading...
module.docker_cache.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
google_project_iam_member.kyma_developer_admin_logging_viewer: Refreshing state... [id=kyma-project/roles/logging.viewer/group:kyma_developer_admin@sap.com]
data.google_project.kyma_project: Read complete after 0s [id=projects/kyma-project]
module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod]
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
module.signify_secret_rotator.google_service_account.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.restricted-markets-artifactregistry-reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.image_syncer_writer: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
google_secret_manager_secret.image_builder_sa_key_restricted_markets: Refreshing state... [id=projects/sap-kyma-prow/secrets/image-builder-sa-key-restricted-markets]
google_service_account.terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 1s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
google_service_account.sa-dev-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-dev-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
module.security_dashboard_token.google_cloud_run_service.security_dashboard_token: Refreshing state... [id=locations/europe-west1/namespaces/sap-kyma-prow/services/security-dashboard-token]
google_secret_manager_secret.kyma_bot_public_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token]
module.signify_secret_rotator.data.google_project.project: Reading...
google_secret_manager_secret.kyma_modules_runtime_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Reading...
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
data.google_client_config.gcp: Read complete after 1s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
google_secret_manager_secret.internal_github_terraform_planner: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token]
module.service_account_keys_rotator.data.google_project.project: Reading...
google_secret_manager_secret.internal_github_terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token]
module.signify_secret_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.image_syncer_reader: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 1s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
google_service_account.kyma-submission-pipeline: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.dora_integration_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token]
google_pubsub_topic.secrets_rotator_dead_letter: Refreshing state... [id=projects/sap-kyma-prow/topics/secrets-rotator-dead-letter]
google_service_account.kyma-modules-reader-modg: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sec-scanner-cfg-processor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.dockerhub_oat_secret[0]: Read complete after 0s [id=projects/351981214969/secrets/docker_sap_org_service_auth_token/versions/1]
google_service_account.sa-secret-update: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-secret-update@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
module.service_account_keys_rotator.data.google_project.project: Read complete after 0s [id=projects/sap-kyma-prow]
data.google_project.current: Reading...
google_service_account.neighbors-conduit-cli-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/neighbors-conduit-cli-builder@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.chainguard_pull_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token]
google_service_account.gitleaks_secret_accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
google_service_account.sa-kyma-project: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-kyma-project@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret.sec-scanner-cfg-processor-gcp-sa-key: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
google_service_account.gitleaks-secret-accesor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.kyma-security-scanners: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
data.google_project.current: Read complete after 0s [id=projects/sap-kyma-prow]
google_service_account.kyma-oci-image-builder: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/kyma-oci-image-builder@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Reading...
module.security_dashboard_token.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.secrets-rotator: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Reading...
google_service_account.terraform-planner: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
google_service_account.terraform-executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account.sa-security-dashboard-oauth: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-security-dashboard-oauth@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_secret_manager_secret.doc_collector_internal_github_token: Preparing import... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
google_secret_manager_secret.doc_collector_internal_github_token: Refreshing state... [id=projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token]
data.github_organization.kyma_internal: Reading...
data.github_repository.kyma_modules_internal: Reading...
data.github_repository.restricted_markets_docu_hub: Reading...
google_service_account_iam_member.restricted_markets_artifactregistry_reader_impersonation: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:gcr-writer@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_cloud_run_service.service_account_keys_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-rotator]
module.signify_secret_rotator.data.google_monitoring_notification_channel.kyma_tooling: Read complete after 0s [id=projects/sap-kyma-prow/notificationChannels/5909844679104799956]
github_actions_variable.gcp_terraform_executor_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_EXECUTOR_SERVICE_ACCOUNT_EMAIL]
module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_run_service.service_account_keys_cleaner: Refreshing state... [id=locations/europe-west4/namespaces/sap-kyma-prow/services/service-account-keys-cleaner]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secrets_versions_manager: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionManager/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_secret_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.test_infra: Read complete after 3s [id=test-infra]
module.service_account_keys_cleaner.google_project_iam_member.service_account_keys_cleaner_sa_keys_admin: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.kyma_modules_internal: Read complete after 1s [id=kyma-modules]
github_actions_organization_variable.image_syncer_writer_service_account_email: Refreshing state... [id=IMAGE_SYNCER_WRITER_SERVICE_ACCOUNT_EMAIL]
github_actions_variable.gcp_terraform_planner_service_account_email: Refreshing state... [id=test-infra:GCP_TERRAFORM_PLANNER_SERVICE_ACCOUNT_EMAIL]
google_storage_bucket_iam_binding.planner_state_bucket_write_access: Refreshing state... [id=b/tf-state-kyma-project/roles/storage.objectUser]
data.github_repository.gitleaks_repository["test-infra"]: Read complete after 3s [id=test-infra]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/iam.securityReviewer"]: Refreshing state... [id=sap-kyma-prow/roles/iam.securityReviewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/storage.objectViewer"]: Refreshing state... [id=sap-kyma-prow/roles/storage.objectViewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_member.terraform_planner_prow_project_read_access["roles/viewer"]: Refreshing state... [id=sap-kyma-prow/roles/viewer/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_organization_variable.dora_integration_public_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_PUBLIC_GITHUB_TOKEN_GCP_SECRET_NAME]
github_actions_variable.kyma_modules_runtime_internal_github_token_gcp_secret_name: Refreshing state... [id=kyma-modules:KYMA_PROW_SERVICEUSER_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_project_iam_member.signify_secret_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
data.github_repository.restricted_markets_docu_hub: Read complete after 1s [id=product-kyma-runtime-fork]
module.signify_secret_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:signify-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_monitoring_alert_policy.service_account_keys_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/8834342864758449670]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_planner_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-planner-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.internal_github_terraform_planner_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_PLANNER_SECRET_NAME]
google_secret_manager_secret_iam_member.terraform_planner_internal_github_executor_secret_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/iac-bot-gh-tools-sap-terraform-executor-token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
github_actions_variable.internal_github_terraform_executor_secret_name: Refreshing state... [id=test-infra:INTERNAL_GITHUB_TERRAFORM_EXECUTOR_SECRET_NAME]
github_actions_organization_variable.image_syncer_reader_service_account_email: Refreshing state... [id=IMAGE_SYNCER_READER_SERVICE_ACCOUNT_EMAIL]
github_actions_organization_variable.dora_integration_internal_github_token_gcp_secret_name: Refreshing state... [id=DORA_INTEGRATION_INTERNAL_GITHUB_TOKEN_GCP_SECRET_NAME]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountKeyAdmin/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Refreshing state... [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_accessor: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretAccessor/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_adder: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.secretVersionAdder/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_rotator.google_project_iam_member.service_account_keys_rotator_secret_version_viewer: Refreshing state... [id=sap-kyma-prow/roles/secretmanager.viewer/serviceAccount:sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Reading...
google_secret_manager_secret_iam_member.chainguard_token_artifactregistry_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:service-905162714753@gcp-sa-artifactregistry.iam.gserviceaccount.com]
data.google_secret_manager_secret_version.chainguard_pull_token_password: Read complete after 0s [id=projects/351981214969/secrets/chainguard_auth_token/versions/1]
google_secret_manager_secret_iam_member.sec_scanner_cfg_processor_secret_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sec-scanner-cfg-gcp-sa-key/roles/secretmanager.secretAccessor/serviceAccount:kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.chainguard_token_terraform_planner_access: Refreshing state... [id=projects/sap-kyma-prow/secrets/chainguard_auth_token/roles/secretmanager.secretAccessor/serviceAccount:terraform-planner@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["group:cam_dx_kyma_gcp_sre@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/group:cam_dx_kyma_gcp_sre@sap.com]
module.kyma_modules.google_artifact_registry_repository_iam_member.reader_access["serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
module.signify_secret_rotator.google_monitoring_alert_policy.signify_secret_rotator_error_alert: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/5685251492968365145]
module.security_dashboard_token.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west1/services/security-dashboard-token]
github_actions_variable.kyma_autobump_bot_github_token_secret_name: Refreshing state... [id=test-infra:KYMA_AUTOBUMP_BOT_GITHUB_SECRET_NAME]
google_secret_manager_secret_iam_member.kyma_modules_update_components_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-prow-serviceuser-internal-github-token/roles/secretmanager.secretAccessor/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/subject/repository_id:172960:repository_owner_id:2457:workflow:Update Component Version on Push]
google_secret_manager_secret_iam_member.dora_integration_workflow_public_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.reusable_workflow_ref/kyma/dora-integration/.github/workflows/dora-integration.yml@refs/heads/main]
google_secret_manager_secret_iam_member.dora_integration_workflow_internal_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/dora-integration-gh-tools-serviceuser-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-tools-sap/attribute.reusable_workflow_ref/kyma/dora-integration/.github/workflows/dora-integration.yml@refs/heads/main]
module.github_webhook_gateway.google_cloud_run_service.github_webhook_gateway: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/github-webhook-gateway]
google_artifact_registry_repository_iam_member.restricted_prod_writers: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod/roles/artifactregistry.writer/group:kyma-restricted-registry-prod-write@sap.com]
module.docker_cache.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/cache/roles/artifactregistry.repoAdmin/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.restricted_dev_writers: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev/roles/artifactregistry.writer/group:kyma-restricted-registry-dev-write@sap.com]
google_artifact_registry_repository_iam_member.sec_scanner_cfg_processor_kyma_modules_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:sec-scanner-cfg-processor@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.kyma_modules_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.kyma_modules_reader_modg: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.reader/serviceAccount:modg-vuln-mgmt-reg-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
google_artifact_registry_repository_iam_member.image_syncer_prod_repo_writer: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.createOnPushWriter/serviceAccount:image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com]
google_artifact_registry_repository_iam_member.image_syncer_prod_repo_reader: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/prod/roles/artifactregistry.reader/serviceAccount:image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project]
module.kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
module.dev_kyma_modules.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dev-kyma-modules/roles/artifactregistry.repoAdmin/serviceAccount:kyma-submission-pipeline@sap-kyma-prow.iam.gserviceaccount.com]
module.signify_secret_rotator.google_cloud_run_service_iam_member.signify_secret_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/signify-secret-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
data.github_organization.kyma_project: Read complete after 9s [id=39153523]
module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-service-account-keys-rotator]
module.signify_secret_rotator.google_pubsub_subscription.signify_secret_rotator: Refreshing state... [id=projects/sap-kyma-prow/subscriptions/secrets-rotator-signify-secret-rotator]
module.service_account_keys_rotator.google_cloud_run_service_iam_member.service_account_keys_rotator_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-rotator/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.google_cloud_scheduler_job.service_account_keys_cleaner: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/jobs/service-account-keys-cleaner]
module.service_account_keys_cleaner.google_cloud_run_service_iam_member.service_account_keys_cleaner_invoker: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west4/services/service-account-keys-cleaner/roles/run.invoker/serviceAccount:secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/github-webhook-gateway]
module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror]
module.gh_com_kyma_project_workload_identity_federation.google_iam_workload_identity_pool_provider.main: Refreshing state... [id=projects/sap-kyma-prow/locations/global/workloadIdentityPools/github-com-kyma-project/providers/github-com-kyma-project]
module.slack_message_sender.google_cloud_run_service_iam_policy.slack_message_sender: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/slack-message-sender]
module.slack_message_sender.google_eventarc_trigger.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west3/triggers/issue-labeled]
google_service_account_iam_member.terraform_planner_workload_identity_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Pull Plan Prod Terraform]
google_service_account_iam_binding.terraform_planner_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-planner@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_service_account_iam_member.image_syncer_reader_workflow_sa_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-reader@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:pull_request_target:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main]
google_service_account_iam_member.terraform_executor_workload_identity_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/subject/repository_id:147495537:repository_owner_id:39153523:workflow:Post Apply Prod Terraform]
google_service_account_iam_member.image_syncer_writer_workflow_sa_user: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/image-syncer-writer@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_run/event_name:push:repository_owner_id:39153523:reusable_workflow_ref:kyma-project/test-infra/.github/workflows/image-syncer.yml@refs/heads/main]
google_secret_manager_secret_iam_member.image_builder_reusable_workflow_principal_ado_pat_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/image-builder-ado-pat/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.reusable_workflow_ref/kyma-project/test-infra/.github/workflows/image-builder.yml@refs/heads/main]
google_secret_manager_secret_iam_member.autobump_security_config_workflow_token_reader: Refreshing state... [id=projects/sap-kyma-prow/secrets/kyma-bot-github-public-repo-token/roles/secretmanager.secretAccessor/principalSet://iam.googleapis.com/projects/351981214969/locations/global/workloadIdentityPools/github-com-kyma-project/attribute.workflow_ref/kyma-project/test-infra/.github/workflows/autobump-security-config.yaml@refs/heads/main]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_service_account_iam_binding.gitleaks_workload_identity_federation_binding["test-infra"]: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/gitleaks-secret-accesor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.chainguard_cache.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/chainguard-cache]
github_actions_organization_variable.gh_com_kyma_project_gcp_workload_identity_federation_provider: Refreshing state... [id=GH_COM_KYMA_PROJECT_GCP_WORKLOAD_IDENTITY_FEDERATION_PROVIDER]
module.dockerhub_mirror.google_artifact_registry_repository_iam_member.service_account_repoAdmin_access["azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/dockerhub-mirror/roles/artifactregistry.repoAdmin/serviceAccount:azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com]
module.restricted_prod.data.google_client_config.this: Reading...
module.restricted_prod.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.restricted_dev.data.google_client_config.this: Reading...
module.restricted_dev.data.google_client_config.this: Read complete after 0s [id=projects/"kyma-project"/regions/"europe-west4"/zones/<null>]
module.restricted_dev.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-dev]
module.restricted_prod.google_artifact_registry_repository.protected_repository[0]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-prod]
module.restricted_dev.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-dev-read@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-dev/roles/artifactregistry.reader/group:kyma-restricted-registry-dev-read@sap.com]
module.restricted_prod.google_artifact_registry_repository_iam_member.reader_access["group:kyma-restricted-registry-prod-read@sap.com"]: Refreshing state... [id=projects/kyma-project/locations/europe/repositories/restricted-prod/roles/artifactregistry.reader/group:kyma-restricted-registry-prod-read@sap.com]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.chainguard_cache.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/chainguard-cache"
        name                   = "chainguard-cache"
      ~ update_time            = "2026-01-19T16:08:51.412422Z" -> "2026-01-20T09:46:20.398687Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2026-01-20T07:09:43.867570Z" -> "2026-01-20T10:39:23.042817Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2026-01-20T07:11:38.670571Z" -> "2026-01-20T10:38:14.508751Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2026-01-20T07:42:28.641557Z" -> "2026-01-20T10:39:14.536938Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.kyma_restricted_images_dev.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-dev"
        name                   = "kyma-restricted-images-dev"
      ~ update_time            = "2026-01-20T03:07:08.342351Z" -> "2026-01-20T09:41:39.870567Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.kyma_restricted_images_prod.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/kyma-restricted-images-prod"
        name                   = "kyma-restricted-images-prod"
      ~ update_time            = "2026-01-12T11:46:57.916877Z" -> "2026-01-20T09:22:03.148910Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2026-01-20T03:25:34.349535Z" -> "2026-01-20T10:28:14.432581Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place (current -> planned)

OpenTofu planned the following actions, but then encountered a problem:

  # google_cloud_identity_group_membership.azure_pipeline_image_builder_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "azure_pipeline_image_builder_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/01yyy98l2u8q924"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "azure-pipeline-image-builder@kyma-project.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.developers_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "developers_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-developers@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.developers_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "developers_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-developers@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_dev_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write" {
      + create_time = (known after apply)
      + group       = "groups/023ckvvd0rmgw6a"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write" {
      + create_time = (known after apply)
      + group       = "groups/01egqt2p1a2johw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/01fob9te0l19xwg"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_signer_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "image_signer_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-signer@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-markets-delivery@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/03fwokq04jj0scm"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/00meukdy10z0qky"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_secret_manager_secret.doc_collector_internal_github_token will be updated in-place
  # (imported from "projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token")
  ~ resource "google_secret_manager_secret" "doc_collector_internal_github_token" {
        annotations           = {}
        create_time           = "2025-08-29T11:26:20.129527Z"
        effective_annotations = {}
      ~ effective_labels      = {
          ~ "component"       = "workflow" -> "github-workflow"
            "entity"          = "technical-writers-docuforge-serviceuser"
          + "github-instance" = "internal"
            "owner"           = "neighbors"
          ~ "tool"            = "docuforge" -> "doc-collector"
          ~ "type"            = "serviceuser-token" -> "github-token"
        }
        id                    = "projects/sap-kyma-prow/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token"
      ~ labels                = {
          + "component"       = "github-workflow"
          + "github-instance" = "internal"
          + "owner"           = "neighbors"
          + "tool"            = "doc-collector"
          + "type"            = "github-token"
        }
        name                  = "projects/351981214969/secrets/technical-writers-docsync-workflow-gh-tools-neighbors-token"
        project               = "sap-kyma-prow"
        secret_id             = "technical-writers-docsync-workflow-gh-tools-neighbors-token"
      ~ terraform_labels      = {
          + "component"       = "github-workflow"
          + "github-instance" = "internal"
          + "owner"           = "neighbors"
          + "tool"            = "doc-collector"
          + "type"            = "github-token"
        }
        version_aliases       = {}

        replication {
            auto {
            }
        }
    }

Plan: 1 to import, 14 to add, 1 to change, 0 to destroy.

Error: Your token has not been granted the required scopes to execute this query. The 'email' field requires one of the following scopes: ['user:email', 'read:user'], but your token has only been granted the: ['admin:org', 'repo'] scopes. Please modify your token's scopes at: https://github.tools.sap/settings/tokens.

  with data.github_organization.kyma_internal,
  on doc-collector.tf line 42, in data "github_organization" "kyma_internal":
  42: data "github_organization" "kyma_internal" {

::error::OpenTofu exited with code 1.

```

</details>

`

<!-- github-comment: {"Command":"apply","JobName":"post-apply-prod-terraform","PRNumber":13749,"Program":"tfcmt","SHA1":"aa2486639bddb64ab9f4f258e2bd1e838fcae63c","Vars":{},"WorkflowName":"Post Apply Prod Terraform"} -->